; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-1-2-2-185)
	(:domain driverlog)
	(:objects
	driver1 - driver
	truck1 - truck
	truck2 - truck
	package1 - obj
	package2 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p6-0 - location
	p6-5 - location
	p2-0 - location
	p2-5 - location
	p1-2 - location
	p0-1 - location
	p4-1 - location
	p4-3 - location
	p3-0 - location
	p3-6 - location
	)
	(:init
	(at driver1 s0)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s1)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at package1 s2)
	(at package2 s6)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(= (time-to-walk s6 p6-0) 30)
	(= (time-to-walk p6-0 s6) 30)
	(= (time-to-walk s0 p6-0) 29)
	(= (time-to-walk p6-0 s0) 29)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(= (time-to-walk s6 p6-5) 29)
	(= (time-to-walk p6-5 s6) 29)
	(= (time-to-walk s5 p6-5) 17)
	(= (time-to-walk p6-5 s5) 17)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 9)
	(= (time-to-walk p2-0 s2) 9)
	(= (time-to-walk s0 p2-0) 21)
	(= (time-to-walk p2-0 s0) 21)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(= (time-to-walk s2 p2-5) 28)
	(= (time-to-walk p2-5 s2) 28)
	(= (time-to-walk s5 p2-5) 10)
	(= (time-to-walk p2-5 s5) 10)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 30)
	(= (time-to-walk p1-2 s1) 30)
	(= (time-to-walk s2 p1-2) 30)
	(= (time-to-walk p1-2 s2) 30)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 10)
	(= (time-to-walk p0-1 s0) 10)
	(= (time-to-walk s1 p0-1) 30)
	(= (time-to-walk p0-1 s1) 30)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(= (time-to-walk s4 p4-1) 30)
	(= (time-to-walk p4-1 s4) 30)
	(= (time-to-walk s1 p4-1) 8)
	(= (time-to-walk p4-1 s1) 8)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 28)
	(= (time-to-walk p4-3 s4) 28)
	(= (time-to-walk s3 p4-3) 36)
	(= (time-to-walk p4-3 s3) 36)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 26)
	(= (time-to-walk p3-0 s3) 26)
	(= (time-to-walk s0 p3-0) 11)
	(= (time-to-walk p3-0 s0) 11)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(= (time-to-walk s3 p3-6) 29)
	(= (time-to-walk p3-6 s3) 29)
	(= (time-to-walk s6 p3-6) 32)
	(= (time-to-walk p3-6 s6) 32)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 18)
	(= (time-to-drive s6 s3) 18)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 23)
	(= (time-to-drive s0 s4) 23)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 12)
	(= (time-to-drive s3 s4) 12)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 28)
	(= (time-to-drive s6 s4) 28)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 7)
	(= (time-to-drive s6 s0) 7)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 31)
	(= (time-to-drive s0 s2) 31)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 15)
	(= (time-to-drive s1 s2) 15)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 31)
	(= (time-to-drive s4 s2) 31)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 4)
	(= (time-to-drive s5 s2) 4)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 23)
	(= (time-to-drive s6 s2) 23)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 30)
	(= (time-to-drive s1 s6) 30)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 35)
	(= (time-to-drive s3 s1) 35)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 33)
	(= (time-to-drive s1 s5) 33)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 36)
	(= (time-to-drive s6 s5) 36)
	(= (fuel-used) 0)
)
	(:goal (and
	(at truck1 s5)
	(at package1 s2)
	(at package2 s4)
	))

(:metric minimize (+ (* 3 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (walk driver1 s0 p2-0)
   deleted: (at driver1 s0)
   added: (at driver1 p2-0)
   goals met: 1 of 3
2. (walk driver1 p2-0 s2)
   deleted: (at driver1 p2-0)
   added: (at driver1 s2)
   goals met: 1 of 3
3. (board-truck driver1 truck1 s2)
   deleted: (at driver1 s2) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 1 of 3
4. (drive-truck truck1 s2 s6 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   changed: (fuel-used) from 0 to 230
   goals met: 1 of 3
5. (load-truck package2 truck1 s6)
   deleted: (at package2 s6)
   added: (in package2 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 1 of 3
6. (drive-truck truck1 s6 s4 driver1)
   deleted: (at truck1 s6)
   added: (at truck1 s4)
   changed: (fuel-used) from 230 to 538
   goals met: 1 of 3
7. (unload-truck package2 truck1 s4)
   deleted: (in package2 truck1)
   added: (at package2 s4)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 2 of 3
8. (drive-truck truck1 s4 s6 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s6)
   changed: (fuel-used) from 538 to 818
   goals met: 2 of 3
9. (drive-truck truck1 s6 s5 driver1)
   deleted: (at truck1 s6)
   added: (at truck1 s5)
   changed: (fuel-used) from 818 to 1178
   goals met: 3 of 3
